#ifndef SRC_RENDER_H_
#define SRC_RENDER_H_

#include "defines.h"

/**************************************************************************************************
 *  Функция отрисовки графика на экран
 *
 *          Аргументы:
 *  double table[SRC_W] - массив с y координатами каждой точки на экране
 *       (размер массива соответствует ширине вывода).
**************************************************************************************************/
void render(double table[SRC_W]);

/**************************************************************************************************
 *  Функция начального заполнения графика  знаками "."
 *
 *          Аргументы:
 *  char screen[SRC_W][SRC_H] -  двумерный массив.
 *       (размер массива соответствует ширине  и высоте вывода).
**************************************************************************************************/
void start_filling(char screen[SRC_W][SRC_H]);

/**************************************************************************************************
 *  Функция вывода массива с графиком функции в терминал.
 *
 *          Аргументы:
 *  char screen[SRC_W][SRC_H] -  двумерный массив, заполненый "*",
 *  согласно графику исследуемой функции.
 *       (размер массива соответствует ширине  и высоте вывода).
**************************************************************************************************/
void output(char screen[SRC_W][SRC_H]);

#endif  // SRC_RENDER_H_
